whittejr/arm-cortex/tools/svd/STM32WB55_CM44.svd
         </registers>
      </peripheral>

   <peripheral>
      <name>SysTick</name>
      <description>System timer</description>
      <groupName>CORE</groupName>
      <baseAddress>0xE000E010</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <description>SysTick Control and Status Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RVR</name>
          <description>SysTick Reload Value Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CVR</name>
          <description>SysTick Current Value Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CALIB</name>
          <description>SysTick Calibration Value Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>CORE</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x350</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ISER%s</name>
          <description>Interrupt Set-Enable Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
        </register>
        <register>
          <name>ICER%s</name>
          <description>Interrupt Clear-Enable Register</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
        </register>
        <register>
          <name>ISPR%s</name>
          <description>Interrupt Set-Pending Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
        </register>
        <register>
          <name>ICPR%s</name>
          <description>Interrupt Clear-Pending Register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
        </register>
        <register>
          <name>IABR%s</name>
          <description>Interrupt Active Bit Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
        </register>
        <register>
          <name>IPR%s</name>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <dim>60</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59</dimIndex>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>SCB</name>
      <description>System Control Block</description>
      <groupName>CORE</groupName>
      <baseAddress>0xE000ED00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CPUID</name>
          <description>CPUID Base Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>ICSR</name>
          <description>Interrupt Control and State Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>VTOR</name>
          <description>Vector Table Offset Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AIRCR</name>
          <description>Application Interrupt and Reset Control Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SCR</name>
          <description>System Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CCR</name>
          <description>Configuration and Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SHPR1</name>
          <description>System Handler Priority Register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SHPR2</name>
          <description>System Handler Priority Register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SHPR3</name>
          <description>System Handler Priority Register 3</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SHCSR</name>
          <description>System Handler Control and State Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFSR</name>
          <description>Configurable Fault Status Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HFSR</name>
          <description>HardFault Status Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>DFSR</name>
          <description>Debug Fault Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>MMFAR</name>
          <description>MemManage Fault Address Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BFAR</name>
          <description>BusFault Address Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>

   </peripherals>
</device>
